package practice.step.examples.part1;

/**
 * Объявление переменных и присваивание значений.
 */
public class Task00 {
    public static void main(String[] args) {
        /**  int i = 99; // объявление переменной
         int j = i + 1; // нельзя использовать переменную в коде пока она не инициализированна

         i = 1; // инициализация (установление значения переменной)

         System.out.println(i); // вывод значения переменной в консоль

         i = 2; // установление нового значения
         System.out.println(i); // вывод нового значения переменной в консоль */

        // FIXME Объявите новую переменную с именем x и типом int
        // установите значение переменной 3 присвойте значение переменной i в
        // переменную x и выведите значение переменной i и j и x на консоль.
        int x = 3;
        int i = x;
        int j = i + 99;
        System.out.println(x);
        System.out.println(i);
        System.out.println(j);


    }
}